import React from "react";
import {Link} from "react-router-dom";
import Footer from "../footer/footer";
import { useSelector } from "react-redux";
import Basket from "../basket/basket";

import "./delivery-and-payment.css";

const DeliveryAndPayment = () => {

    const totalItem = useSelector(state => state.cart.totalItem);

    return (
       <div>
            <div className="delivery-and-payment">
            <div className="back-shop">
                <Link to="/">Повернутися до каталогу</Link>
            </div>
            <div className="delivery-info">
                <div className="delivery-title">
                    <h1>Доставка та оплата</h1>
                    <p>Екофренд — це магазин свідомого споживача, де можна знайти предмети 
                        щоденного вжитку багаторазового використання чи екологічніші альтернативи.
                    </p>
                    <p>Ми хочемо, щоб ваші покупки були максимально приємними, тому пропонуємо зручну систему
                        оплати та доставку по Києву та за його межами.
                    </p>
                </div>
                <div className="payment">
                    <h3>Оплата</h3>
                    Ви можете оплатити замовлення на банківську карту:
                    <ul>
                        <li>
                            • Приватбанк: <span>0000 0000 0000 0000</span>
                        </li>
                        <li>
                            • Монобанк: <span>0000 0000 0000 0000</span>
                        </li>
                    </ul>
                    <p>Ми працюємо по 100% передоплаті.</p>
                </div>
                <div className="delivery">
                    <h3>Доставка</h3>
                    Доставка по всій Україні здійснюється:
                    <ul>
                        <li>
                            • До відділення Нової пошти
                        </li>
                        <li>
                            • Адресна доставка кур'єром Нової пошти
                        </li>
                        <li>
                            • Відправлення товарів протягом 24 годин пicля замовлення, вартість згідно тарифів перевізника (орієнтовно 40 грн)
                        </li>
                        <li>
                            • При замовленні на суму від 500 грн — доставка БЕЗКОШТОВНА.
                        </li>
                    </ul>
                </div>
                <div className="swap">
                    <h3>Обмін та повернення</h3>
                    Для того, щоб зробити повернення або обмін товару належної якості, переконайтеся в наступному:
                    <ul>
                        <li>
                            - пройшло не більше 14 днів днів з моменту покупки (без урахування дня покупки)
                        </li>
                        <li>
                            - збережений товарний вигляд;
                        </li>
                        <li>
                            - товар не був у використанні;
                        </li>
                        <li>
                            - товар не входить в список товарів, що не підлягають поверненню відповідно до законодавства;
                        </li>
                        <li>
                            - в наявності вся комплектація товару, в тому числі упаковка без пошкоджень.
                        </li>
                    </ul>
                    <p>Згідно статті 9 Закону України "Про захист прав споживачів" предмети сангігієни та зубні щітки поверненню та обміну не підлягають. Джерело за посиланням: https://zakon.rada.gov.ua/laws/show/216-91-%D0%BF</p>
                    У разі виявлення дефекту товару:
                    <ul>
                        <li>
                            - Ми відповідаємо за якість нашої продукції, тому безкоштовно зробимо обмін товару або повернення коштів за нього в разі виявлення на продукті значного виробничого браку або дефекту
                        </li>
                        <li>
                            - При відправці транспортною компанією «Нова Пошта» кожна посилка страхується на повну суму вартості продукту. У цих випадках відповідальність за збереження цілісності товару несе транспортна компанія «Нова Пошта». Радимо подивитися посилку при її отриманні безпосередньо на відділенні Нової пошти, щоб переконатися в її цілісності. У разі виявлення слідів пошкоджень при транспортуванні, повідомте про це працівнику Нової Пошти і складіть акт прийому-передачі і претензії.
                        </li>
                    </ul>
                </div>
            </div>
        </div>
        <div className="additional-info">
                <div className="additional">
                    Якщо все ж у вас виникли якісь непорозуміння щодо замовлених товарів чи товар виявився з дефектами,
                    можна це врегулювати декількома способами впродовж 14 днів після замовлення:
                </div>
                <div>
                   <div>E-mail: <span>ecoshop@gmail.com</span></div>
                    <div>Телефон / Telegram / Viber: <span>+38 000 000 00 00</span></div>
                    <div className="social">Соцмережі: <Link to="/">Instagram</Link></div>
                </div>
            </div>
        { totalItem > 0 ? <Basket/> : null}
        <Footer/>
       </div>
    )
}

export default DeliveryAndPayment;